oe-rv2309/mugen-riscv_rc3/logs/fio/oe_test_fio_002/2023-09-21-23:18:45.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Thu Sep 21 23:18:49 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks='vdb vdc'
+ disk_list=($disks)
+ local_disk=vdb
+ local_disk1=vdc
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
Thu Sep 21 23:19:10 2023 - INFO  - pkgs:(fio) is already installed
+ tmpfile2=
+ '[' -z '' ']'
+ tmpfile=
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Thu Sep 21 23:19:11 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Thu Sep 21 23:19:11 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/vdb
+ grep 'items processed'
Threads(4): 524288 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -o option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -c 1 /dev/vdc
+ grep 'items processed'
Threads(4): 524288 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -c option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -B 1 /dev/vdc
Will check </dev/vdc>, size <2147483648>, using 4 threads
Threads(4): 524288 items processed
Extents=524288, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -B option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -p 1 /dev/vdc
Will check </dev/vdc>, size <2147483648>, using 4 threads
Threads(4): 524288 items processed
Extents=524288, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -p option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=2061: Thu Sep 21 23:21:13 2023
  write: IOPS=2847, BW=11.1MiB/s (11.7MB/s)(1024MiB/92070msec); 0 zone resets
    slat (usec): min=129, max=21658, avg=273.25, stdev=185.11
    clat (usec): min=225, max=409032, avg=5331.16, stdev=9474.19
     lat (usec): min=650, max=410134, avg=5604.41, stdev=9493.05
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    7], 95.00th=[    8],
     | 99.00th=[   10], 99.50th=[   11], 99.90th=[  199], 99.95th=[  284],
     | 99.99th=[  388]
   bw (  KiB/s): min= 3379, max=14581, per=100.00%, avg=11397.54, stdev=2495.34, samples=183
   iops        : min=  844, max= 3645, avg=2849.13, stdev=623.85, samples=183
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=10.28%, 10=89.21%, 20=0.30%, 50=0.09%
  lat (msec)   : 100=0.01%, 250=0.05%, 500=0.07%
  cpu          : usr=3.03%, sys=87.15%, ctx=1642, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=11.1MiB/s (11.7MB/s), 11.1MiB/s-11.1MiB/s (11.7MB/s-11.7MB/s), io=1024MiB (1074MB), run=92070-92070msec

Disk stats (read/write):
  vda: ios=0/261608, merge=0/9680, ticks=0/169084, in_queue=174314, util=99.87%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=3931542/0, merge=0/0, ticks=6950554/0, in_queue=6950554, util=94.65%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=726/3929354, merge=0/2330, ticks=510/5629568, in_queue=5630078, util=90.84%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.34
Starting 30 threads
Thu Sep 21 23:48:45 2023 - ERROR - Timeout : Command 'bash -x oe_test_fio_002.sh' timed out after 1799.9997604 seconds

mytest: (groupid=0, jobs=30): err= 0: pid=2162: Thu Sep 21 23:52:20 2023
  read: IOPS=6153, BW=96.2MiB/s (101MB/s)(60.0GiB/638997msec)
    clat (usec): min=243, max=1032.3k, avg=4761.07, stdev=4670.40
     lat (usec): min=247, max=1032.3k, avg=4764.90, stdev=4676.41
    clat percentiles (usec):
     |  1.00th=[   676],  5.00th=[  1221], 10.00th=[  1729], 20.00th=[  2507],
     | 30.00th=[  3097], 40.00th=[  3589], 50.00th=[  4015], 60.00th=[  4490],
     | 70.00th=[  5080], 80.00th=[  5932], 90.00th=[  7898], 95.00th=[ 10683],
     | 99.00th=[ 19530], 99.50th=[ 25560], 99.90th=[ 45876], 99.95th=[ 58983],
     | 99.99th=[117965]
   bw (  KiB/s): min=20714, max=266461, per=100.00%, avg=100234.00, stdev=729.89, samples=37335
   iops        : min= 1274, max=16640, avg=6250.07, stdev=45.64, samples=37335
  lat (usec)   : 250=0.01%, 500=0.25%, 750=1.17%, 1000=1.79%
  lat (msec)   : 2=10.01%, 4=36.23%, 10=44.82%, 20=4.79%, 50=0.86%
  lat (msec)   : 100=0.07%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.80%, sys=7.15%, ctx=3885300, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3932160,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=96.2MiB/s (101MB/s), 96.2MiB/s-96.2MiB/s (101MB/s-101MB/s), io=60.0GiB (64.4GB), run=638997-638997msec

Disk stats (read/write):
  vdb: ios=3935776/0, merge=2/0, ticks=6081436/0, in_queue=6081436, util=96.22%
++ post_test
++ LOG_INFO 'Start environment cleanup.'
++ message='Start environment cleanup.'
++ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Thu Sep 21 23:52:21 2023 - INFO  - Start environment cleanup.
++ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
++ DNF_REMOVE
++ node=1
++ pkg_list=
++ mode=0
++ [[ -z '' ]]
++ [[ -z '' ]]
++ LOG_WARN 'no thing to do.'
++ message='no thing to do.'
++ python3 /root/mugen/libs/locallibs/mugen_log.py --level warn --message 'no thing to do.'
Thu Sep 21 23:52:21 2023 - WARN  - no thing to do.
++ return 0
++ LOG_INFO 'Finish environment cleanup.'
++ message='Finish environment cleanup.'
++ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Thu Sep 21 23:52:22 2023 - INFO  - Finish environment cleanup.
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=209528/3932101, merge=41/37, ticks=199277/5523704, in_queue=5722980, util=91.72%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
+ test -f test.txt
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Fri Sep 22 00:21:03 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 50'
+ message='oe_test_fio_002.sh line 50'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 50'
Fri Sep 22 00:21:06 2023 - ERROR - oe_test_fio_002.sh line 50
+ '[' 0 -eq 1 ']'
+ return 0
+ genfio -d /dev/vdb,/dev/vdc,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
Generating dellr720-day2/openeuler-riscv64-4k,128k,1m-all-write,randwrite,read,randread-vdb,vdc,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Fri Sep 22 00:22:49 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 1
+ test 1 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Fri Sep 22 00:22:51 2023 - ERROR - failed to execute the case.
+ exit 1
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Fri Sep 22 00:22:54 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z '' ]]
+ [[ -z '' ]]
+ LOG_WARN 'no thing to do.'
+ message='no thing to do.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level warn --message 'no thing to do.'
Fri Sep 22 00:22:58 2023 - WARN  - no thing to do.
+ return 0
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Fri Sep 22 00:23:01 2023 - INFO  - Finish environment cleanup.